app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."deleted_at" IS NULL ORDER BY "authors"."id" DESC LIMIT 10 OFFSET 0
---
  def index
    @authors = Author.all.sort { |x, y| y.created_at <=> x.created_at }.paginate(:per_page => 10, :page => params[:page]||1)

UPDATE "authors" SET "dynasty" = ?, "birthday" = ?, "description" = ?, "updated_at" = ? WHERE "authors"."id" = 5  [["dynasty", "付"], ["birthday", "对方"], ["description", "的发售多时告诉"], ["updated_at", Wed, 25 May 2016 06:36:05 UTC +00:00]]
---
  def update
    @author.update_attributes(params[:author])

SELECT "authors".* FROM "authors" WHERE "authors"."deleted_at" IS NULL AND "authors"."id" = ? LIMIT 1  [["id", "5"]]
---
  def set_author
    @author = Author.find(params[:id])