app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "genre", "outer_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "是否打发舒服的沙发上"], ["created_at", Wed, 25 May 2016 06:33:10 UTC +00:00], ["genre", 1], ["outer_id", 2], ["updated_at", Wed, 25 May 2016 06:33:10 UTC +00:00], ["user_id", 1]]
---
  def create
    @comment = Comment.new(params[:comment].merge(:user_id => current_user.id))
    @comment.save