app/controllers/home_controller.rb

  def index
    @songs = Song.where('excellent=1').limit(5)
    @pieces = Piece.where('excellent=1').limit(5)
    @poetries = Poetry.where('excellent=1').limit(5)
    @proses = Prose.where('excellent=1').limit(5)
---
SELECT "songs".* FROM "songs" WHERE "songs"."deleted_at" IS NULL AND "songs"."excellent" = 1 LIMIT 5
SELECT "pieces".* FROM "pieces" WHERE "pieces"."deleted_at" IS NULL AND "pieces"."excellent" = 1 LIMIT 5
SELECT "poetries".* FROM "poetries" WHERE "poetries"."deleted_at" IS NULL AND "poetries"."excellent" = 1 LIMIT 5
SELECT "proses".* FROM "proses" WHERE "proses"."deleted_at" IS NULL AND "proses"."excellent" = 1 LIMIT 5