app/controllers/likes_controller.rb

INSERT INTO "likes" ("created_at", "genre", "outer_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 25 May 2016 06:34:45 UTC +00:00], ["genre", 2], ["outer_id", 1], ["updated_at", Wed, 25 May 2016 06:34:45 UTC +00:00], ["user_id", 1]]
---
  def edit
    @like = Like.new(:user_id => current_user.id, :outer_id => params[:id], :genre => params[:genre])
    @like.save