app/controllers/pieces_controller.rb

  def index
    @pieces = Piece.paginate(:per_page => 10, :page => params[:page]||1).order(id: :desc)
---
SELECT "pieces".* FROM "pieces" WHERE "pieces"."deleted_at" IS NULL ORDER BY "pieces"."id" DESC LIMIT 10 OFFSET 0

  def show
    @comment = Comment.new
    @comments = Comment.where(outer_id: @piece.id, genre: 3).includes(:user).order(id: :desc)
---
SELECT "comments".* FROM "comments" WHERE "comments"."deleted_at" IS NULL AND "comments"."outer_id" = 1 AND "comments"."genre" = 3 ORDER BY "comments"."id" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)

  def create
    @piece = Piece.new(params[:piece].merge(:user_id => current_user.id))
    @piece.save
---
INSERT INTO "pieces" ("author", "author_id", "content", "created_at", "excellent", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def set_piece
    @piece = Piece.find(params[:id])
---
SELECT "pieces".* FROM "pieces" WHERE "pieces"."deleted_at" IS NULL AND "pieces"."id" = ? LIMIT 1  [["id", "1"]]