app/controllers/poetries_controller.rb

  def index
    @poetries = Poetry.all.sort { |x, y| y.created_at <=> x.created_at }.paginate(:page => params[:page]||1, :per_page => 10)
---
SELECT "poetries".* FROM "poetries" WHERE "poetries"."deleted_at" IS NULL ORDER BY "poetries"."id" DESC LIMIT 10 OFFSET 0

  def show
    @comment = Comment.new
    @comments = Comment.where(outer_id: @poetry.id, genre: 1).includes(:user).sort { |x, y| y.created_at <=> x.created_at }
---
SELECT "comments".* FROM "comments" WHERE "comments"."deleted_at" IS NULL AND "comments"."outer_id" = 2 AND "comments"."genre" = 1 ORDER BY "comments"."id" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)

  def create
    @poetry = Poetry.new(params[:poetry].merge(:user_id => current_user.id))
    @poetry.save
---
INSERT INTO "poetries" ("author", "author_id", "content", "created_at", "excellent", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def set_poetry
    @poetry = Poetry.find(params[:id])
---
SELECT "poetries".* FROM "poetries" WHERE "poetries"."deleted_at" IS NULL AND "poetries"."id" = ? LIMIT 1  [["id", "1"]]