app/controllers/proses_controller.rb

SELECT "proses".* FROM "proses" WHERE "proses"."deleted_at" IS NULL ORDER BY "proses"."id" DESC LIMIT 10 OFFSET 0
---
  def index
    @proses = Prose.all.sort { |x, y| y.created_at <=> x.created_at }.paginate(:per_page => 10, :page => params[:page]||1)

SELECT "comments".* FROM "comments" WHERE "comments"."deleted_at" IS NULL AND "comments"."outer_id" = 1 AND "comments"."genre" = 2 ORDER BY "comments"."id" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)
---
  def show
    @comment = Comment.new
    @comments = Comment.where(outer_id: @prose.id, genre: 2).includes(:user).sort { |x, y| y.created_at <=> x.created_at }

INSERT INTO "proses" ("author", "author_id", "content", "created_at", "excellent", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @prose = Prose.new(params[:prose].merge(:user_id => current_user.id))
    @prose.save

SELECT "proses".* FROM "proses" WHERE "proses"."deleted_at" IS NULL AND "proses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def set_prose
    @prose = Prose.find(params[:id])