app/controllers/songs_controller.rb

  def index
    @songs = Song.paginate(:per_page => 10, :page => params[:page]||1).order(id: :desc)
---
SELECT "songs".* FROM "songs" WHERE "songs"."deleted_at" IS NULL ORDER BY "songs"."id" DESC LIMIT 10 OFFSET 0

  def show
    @comment = Comment.new
    @comments = Comment.where(outer_id: @song.id, genre: 4).includes(:user).order(id: :desc)
---
SELECT "comments".* FROM "comments" WHERE "comments"."deleted_at" IS NULL AND "comments"."outer_id" = 1 AND "comments"."genre" = 4 ORDER BY "comments"."id" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)

  def create
    @song = Song.new(params[:song].merge(:user_id => current_user.id))
    @song.save
---
INSERT INTO "songs" ("author", "author_id", "content", "created_at", "excellent", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def set_song
    @song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."deleted_at" IS NULL AND "songs"."id" = ? LIMIT 1  [["id", "1"]]