app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT 10 OFFSET 0
---
  def index
    @users = User.all.sort { |x, y| y.created_at <=> x.created_at }.paginate(:per_page => 10, :page => params[:page]||1)

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "刘向平"], ["updated_at", Wed, 25 May 2016 06:30:50 UTC +00:00]]
---
  def update
    @user.update_attributes(params[:user])